@extends('frontend.layouts.design')
@section('title', 'Горсад - Дизайн | Внешнее пространство')
@section('current-page-link')
    <a href="{{route('outdoor_design')}}">Внешнее пространство</a>
@endsection
@section('content')
    <div class="body-bg">
        <img src="/storage/images/public/design/outdoor/outdoor_design1.jpg" alt="">
    </div>
    <div class="container-pd">
        <article class="design-article">
            <h4 class="heading">Натуральная красота и неповторимость</h4>
            <p class="design-article-text">
                Дизайн внешнего пространства является результатом взаимодействия нескольких элементов, среди которых
                обязательная роль отводится выбору подходящего растения.
                Деревья и множество других растений позволяют создавать бесконечное число возможностей для улучшения
                открытой местности, где будет идеальная гармония баланса и функциональности.
                Применение нашего опыта и знаний специалистами питомника «Натуралист» поможет вам сделать правильный
                выбор и продемонстрирует особенности наших деревьев для Вашего дизайна.
            </p>
        </article>
    </div>
    <div class="body-bg">
        <img src="/storage/images/public/design/outdoor/outdoor_design2.jpg" alt="">
    </div>
    <div class="container-pd">
        <article class="design-article">
            <h4 class="heading">Деревья, у которых есть свои особенности и характер</h4>
            <p class="design-article-text">
                Питомник «Натуралист» занимается выращиванием деревьев с применением собственного опыта и взаимодействия
                в садовом и ландшафтном дизайне.
                В своей работе мы используем творческий подход и постоянно стремимся к внедрению инновации в дизайне,
                цвете и применении деревьев с учетом их индивидуальных характеристик.
                Кто-то обращает внимание на необычную форму и считает это причиной для выбора, а кому-то может быть
                интересен цвет или неповторимый купол.
                Такой подход в работе позволяет выращивать неповторимые деревья, у которых будет свой характер. Так наша
                работа улучшит атмосферу вашего открытого пространства, обеспечит баланс природы в рамках человеческого
                взгляда.
                В питомнике «Натуралист» представлено множество деревьев для парков, бульваров, а также различные виды
                кустарников. Каждое дерево, выращенное нами имеет свой характер, вы обязательно это почувствуете, просто
                посетив наш питомник.
            </p>
            <a href="" class="italic-link-blue mt-3">Выбрать дерево для ландшафтного дизайна</a>
        </article>
    </div>
    <div class="body-bg">
        <img src="/storage/images/public/design/outdoor/outdoor_design3.jpg" alt="">
    </div>
    <div class="container-pd">
        <article class="design-article">
            <h4 class="heading">Натуральный баланс от природы</h4>
            <p class="design-article-text">
                Довольно часто можно увидеть изменения предпочтений от монокультурных садов в определенном стиле к
                смешанному типу, когда у каждого дерева есть собственное место для роста и развития в природной среде.
                Именно этот подход позволяет добиться баланса природы в стандартных городских условиях. И, если дерево
                не будет ограничено в своем развитии и росте, то это обеспечит создание красивого и неповторимого
                габитуса, удобного для долгосрочного обслуживания.
            </p>
        </article>
    </div>
    <div class="body-bg">
        <img src="/storage/images/public/design/outdoor/outdoor_design4.jpg" alt="">
    </div>
    <div class="container-pd">
        <article class="design-article">
            <h4 class="heading">Деревья с множеством стволов</h4>
            <p class="design-article-text w-50 m-auto">
                Деревья с множеством стволов создают идеальный контраст со стандартными образами и профилями городской
                среды. Они придают пространству неповторимую атмосферу комфорта и баланса за счет собственных
                особенностей и интересных форм.
            </p>
            <a href="" class="italic-link-blue mt-3">Получите свою дозу вдохновения прямо сейчас!</a>
        </article>
    </div>
@endsection
