app/Utils/StaticTools.php


                    $object_label = isset($object->title) ? $object->title : $object->name;

                    $object->images()->create([
                        'label' => $object_label . '_0' . $index,
                        'icon' => $icon_path,
                        'small' => $small_path,
                        'medium' => $medium_path,
                        'large' => $large_path,
                        'mimetype' => $file->getClientMimeType()
                    ]);
---
insert into `images` (`label`, `icon`, `small`, `medium`, `large`, `mimetype`, `imageable_id`, `imageable_type`, `updated_at`, `created_at`) values ('Проект 2_00', 'projects/33/pinus_nigra_subsp__nigra_1_icon.jpg', 'projects/33/pinus_nigra_subsp__nigra_1_small.jpg', 'projects/33/pinus_nigra_subsp__nigra_1_medium.jpg', 'projects/33/pinus_nigra_subsp__nigra_1_large.jpg', 'image/jpeg', 33, 'App\Project', '2022-02-16 19:05:19', '2022-02-16 19:05:19')