app/Attribute.php

    public function values()
    {
        return DB::table('attributes_values')
            ->where('attribute_id', $this->id)
            ->get();
---
select * from `attributes_values` where `attribute_id` = 8

    public static function smallFilterAttributes()
    {
        $attributes = Attribute::where('use_for_filter',1)
            ->get();

        foreach ($attributes as $attribute) {
            $values = [];
            foreach ($attribute->values() as $i => $value) {
                array_push($values , [
                    'id' => $value->id,
                    'value' => $value->value
                ]);
---
select * from `attributes` where `use_for_filter` = 1
select * from `attributes`