app/Product.php

    public function savedAttributes()
    {
        $attributes = DB::table('attributes')
            ->whereIn('attributes.id', DB::table('products_attributes')->select('attribute_id')->where('product_id', $this->id))
            ->join('products_attributes','products_attributes.attribute_id','=','attributes.id')
            ->join('attributes_values','attributes_values.attribute_id','=','products_attributes.attribute_id')
            ->select(DB::raw('group_concat(attributes_values.id) as `values`'),'attributes.*','products_attributes.attribute_id', 'products_attributes.id as saved_id')
            ->where('products_attributes.product_id', '=',$this->id)
            ->groupBy('products_attributes.attribute_id')->get();

        $selected_values = DB::table('attributes_values')
            ->join('products_attributes','products_attributes.attribute_value_id','=','attributes_values.id')
            ->where('products_attributes.product_id','=', $this->id)
            ->select(DB::raw('group_concat(attributes_values.id) as svalues'), 'attributes_values.attribute_id')
            ->groupBy('attributes_values.attribute_id')
            ->get();


        $product_attributes = DB::table('products_attributes')
            ->select('attribute_value_id')
            ->where('product_id',$this->id)
            ->get()->toArray();

        $icon_id=0;
        foreach ($attributes as $index => $attribute) {
            $attribute->values = array_values(array_unique(explode(',',$attribute->values)));
            foreach ($selected_values as $i => $values) {
                if($values->attribute_id == $attribute->id)
                {
                    $attribute->selected_values = explode(',',$values->svalues);
---
select group_concat(attributes_values.id) as `values`, `attributes`.*, `products_attributes`.`attribute_id`, `products_attributes`.`id` as `saved_id` from `attributes` inner join `products_attributes` on `products_attributes`.`attribute_id` = `attributes`.`id` inner join `attributes_values` on `attributes_values`.`attribute_id` = `products_attributes`.`attribute_id` where `attributes`.`id` in (select `attribute_id` from `products_attributes` where `product_id` = 1) and `products_attributes`.`product_id` = 1 group by `products_attributes`.`attribute_id`
select group_concat(attributes_values.id) as svalues, `attributes_values`.`attribute_id` from `attributes_values` inner join `products_attributes` on `products_attributes`.`attribute_value_id` = `attributes_values`.`id` where `products_attributes`.`product_id` = 1 group by `attributes_values`.`attribute_id`
select `attribute_value_id` from `products_attributes` where `product_id` = 1
select `attribute_value_id` as `value_id` from `products_attributes` where `product_id` = 1 and `attribute_id` = 55