app/Project.php

    public function plants()
    {
        return Product::select('id', 'title AS text')->whereIn('id', DB::table('project_plants')->select('plant_id')->where('project_id', $this->id))->get();
---
select `id`, `title` as `text` from `products` where `id` in (select `plant_id` from `project_plants` where `project_id` = 30)