app/User.php

select * from `products` where `id` in (select `product_id` from `user_favorites` where `user_id` = 4 group by `product_id`)
---
    public function favorites()
    {
        return Product::whereIn('id', DB::table('user_favorites')
            ->select('product_id')
            ->where('user_id', $this->id)
            ->groupBy('product_id'))
            ->with('images')
            ->get();