<?php
return [
    'types' => [
        'compensation' => [
            'name' => 'Компенсационное озеленение',
            'description' => 'Компенсационное озеленение направленно на восполнение утраченного фонда деревьев'
        ],
        'industrial' => [
            'name' => 'Промышленные объекты',
            'description' => 'Промышленное озеленение играют важное значение в экологии и эстетическом восприятии современных предприятий'
        ],
        'school' => [
            'name' => 'Школы',
            'description' => 'Промышленное озеленение играют важное значение в экологии и эстетическом восприятии современных предприятий'
        ],
        'private' => [
            'name' => 'Частные объекты ',
            'description' => 'Промышленное озеленение играют важное значение в экологии и эстетическом восприятии современных предприятий'
        ],
    ]
];
