app/Http/Controllers/ApiController.php

    public function searchProducts(Request $request)
    {
        if(isset($request->q))
        {
            $products = Product::where('title', 'like', '%'.$request->q.'%')
                ->get();
---
select * from `products` where `title` like '%a%'