app/Http/Controllers/HomeController.php

    public function index()
    {
        $root_category = Category::where('url_title', 'root')->first();
        $categories = Category::all();
        $filter_attributes = Attribute::smallFilterAttributes();
        $cart = session()->get('cart');

        $user = auth()->user();
        if(isset($user))
        {
            $user = User::where('id',auth()->user()->id)->with(['user_notifications', 'companies'])->first();
---
select * from `categories` where `url_title` = 'root' limit 1
select * from `categories`
select * from `user_companies` where `user_companies`.`user_id` in (4)
select * from `user_notifications` where `user_notifications`.`user_id` in (4) order by `created_at` desc
select * from `users` where `id` = 4 limit 1

    public function showShopPage()
    {
        $products = Product::select('*')
            ->with('images')
            ->get();
---
select * from `products`

    public function productPage($product_id)
    {
        $product = Product::where('id', $product_id)
            ->with('images')
            ->with('reviews')
            ->first();
---
select * from `products` where `id` = '1' limit 1
select * from `user_reviews` where `user_reviews`.`product_id` in (1)