app/Http/Controllers/ProjectController.php

    public function index()
    {
        $projects = Project::paginate(10);
---
select * from `projects` limit 10 offset 0
select count(*) as aggregate from `projects`

    public function store(ProjectStoreRequest $request)
    {
        $validated = $request->validated();

        $plants_ids = explode(',', $request->all()['plants']);
        $coordinates = $validated['lat'] . ';' . $validated['long'];

        $project = new Project([
            'name' => $validated['name'],
            'description' => isset($validated['description']) ? $validated['description'] : '',
            'place' => $request->place,
            'area' => isset($validated['area']) ? $validated['area'] : 0,
            'client' => isset($request->client) ? $request->client : '',
            'doneby' => isset($request->doneby) ? $request->doneby : '',
            'coordinates' => $coordinates
        ]);

        if($project->save())
        {
            foreach ($plants_ids as $plants_id) {
                DB::table('project_plants')
                    ->insert([
                       'project_id' => $project->id,
                       'plant_id' => $plants_id
                    ]);
---
insert into `projects` (`name`, `description`, `place`, `area`, `client`, `doneby`, `coordinates`, `updated_at`, `created_at`) values ('Проект 2', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quid est, quod ab ea absolvi et perfici debeat? Duarum enim vitarum nobis erunt instituta capienda. Nemo nostrum istius generis asotos iucunde putat vivere. Quis negat? Quae fere omnia appellantur uno ingenii nomine, easque virtutes qui habent, ingeniosi vocantur. Quis non odit sordidos, vanos, leves, futtiles?', 1, '1200', '', '', '54.71924255352223;20.46777833073601', '2022-02-16 19:05:19', '2022-02-16 19:05:19')
insert into `project_plants` (`project_id`, `plant_id`) values (33, '13')

    public function edit($id)
    {
        $project = Project::with(['images'])->findOrFail($id);
---
select * from `projects` where `projects`.`id` = '33' limit 1

    public function update(ProjectStoreRequest $request, $id)
    {
        $project = Project::findOrFail($id);

        $validated = $request->validated();

        $plants_ids = explode(',', $request->all()['plants']);
        $coordinates = $validated['lat'] . ';' . $validated['long'];

        DB::table('project_plants')
            ->where('project_id', $id)
            ->delete();

        $project->fill([
            'name' => $validated['name'],
            'description' => $validated['description'],
            'place' => $request->place,
            'area' => $validated['area'],
            'client' => isset($request->client) ? $request->client : '-',
            'doneby' => isset($request->doneby) ? $request->doneby : '-',
            'coordinates' => $coordinates
        ]);

        if($project->save())
        {
            foreach ($plants_ids as $plants_id) {
                DB::table('project_plants')
                    ->insert([
                        'project_id' => $project->id,
                        'plant_id' => $plants_id
                    ]);
---
select * from `projects` where `projects`.`id` = '33' limit 1
delete from `project_plants` where `project_id` = '33'
update `projects` set `description` = 'em ipsum dolor sit amet, consectetur adipiscing elit. Quid est, quod ab ea absolvi et perfici debeat? Duarum enim vitarum nobis erunt instituta capienda. Nemo nostrum istius generis asotos iucunde putat vivere. Quis negat? Quae fere omnia appellantur uno ingenii nomine, easque virtutes qui habent, ingeniosi vocantur. Quis non odit sordidos, vanos, leves, futti', `coordinates` = '20.46777833073601;54.71924255352223', `place` = 1, `client` = 'Кутузов Михаил', `doneby` = 'Горсад', `projects`.`updated_at` = '2022-02-16 19:07:04' where `id` = 33
insert into `project_plants` (`project_id`, `plant_id`) values (33, '13')

    public function destroy($id)
    {
        $project = Project::findOrFail($id);

        foreach ($project->images()->pluck('id') as $image_id) {
            $images = array_values(Image::select('icon','small','medium','large')
                ->where('id', $image_id)->get()->toArray()[0]);

            Storage::disk('images')->delete($images);
        }

        $project->images()->delete();
        $project->delete();
---
select * from `projects` where `projects`.`id` = '33' limit 1
select `icon`, `small`, `medium`, `large` from `images` where `id` = 163
delete from `projects` where `id` = 33