app/Http/Controllers/ServiceController.php

select count(*) as aggregate from `services`
select * from `services` limit 20 offset 0
---
    public function index()
    {
        $services = Service::paginate(5);

        return view('admin.services.index')->with('services', $services->toJson());

insert into `services` (`title`, `group_id`, `view`, `updated_at`, `created_at`) values ('555', 0, 'admin.services.static.test', '2022-02-16 03:15:31', '2022-02-16 03:15:31')
insert into `services` (`title`, `group_id`, `view`, `updated_at`, `created_at`) values ('123', 0, 'admin.services.statictest', '2022-02-16 03:13:32', '2022-02-16 03:13:32')
---
    public function store(ServiceRequest $request)
    {
        $input = $request->validated();

        $service = new Service();

        $service->title = $input['title'];
        $service->group_id = 0;
        $service->view = $input['view'];

        if($service->save())
        {
            StaticTools::saveImages($request->images, $service, 'service/'.$service->id);

select * from `services` where `services`.`id` = '3' limit 1
delete from `services` where `id` = 3
---
    public function destroy($id)
    {
        $service = Service::findOrFail($id);
        $service->delete();